<?php

namespace App\Models;

class News
{
    private static $news = [
        1 => [
            "id" => 1,
            "title" => "«Риск невелик, но мы относимся к этому очень серьезно». Генсек НАТО — о вероятности применения Россией ядерного оружия",
            "short" => "Генеральный секретарь НАТО Йенс Столтенберг не считает, что Россия применит ядерное оружие в Украине. Об этом он сказал в интервью для турецкого телеканала NTV.",
            "description" => "Генеральный секретарь НАТО Йенс Столтенберг не считает, что Россия применит ядерное оружие в Украине. Об этом он сказал в интервью для турецкого телеканала NTV.

            «Риск применения Россией ядерного оружия в Украине невелик, но последствия будут огромными, поэтому мы относимся к этому очень серьезно», — заявил генсек.
            
            По словам Столтенберга, Россия ведет себя безответственно и безрассудно. Он также отметил, что применение ядерного оружия изменит саму суть конфликта. «В ядерной войне не будет победителей», — добавил генсек. 
            
            С самого начала войны в Украине президент России Владимир Путин намекает на возможное применение ядерного оружия. В сентябре он подчеркивал, что эти заявления — «не блеф». В конце октября он, однако, сказал, что России «смысла нет никакого — ни политического, ни военного» наносить ядерный удар по Украине.
            
            По данным New York Times, в октябре российское военное руководство проводило совещания, посвященные применению в Украине тактического ядерного оружия.
            
            В октябре министр обороны России Сергей Шойгу и глава Генштаба ВС РФ Валерий Герасимов сообщили США, Великобритании, Китаю и другим странам, что Украина якобы готовит провокацию с применением «грязной бомбы». Позже МАГАТЭ проверило объекты, на которые указала Россия как на места, где такая бомба могла бы разрабатываться — агентство не нашло никаких доказательств, которые могли бы подтвердить заявления российских военных.",
            "category_id" => 1
        ],
        2 => [
            "id" => 2,
            "title" => "Токаев подписал закон, ограничивающий полномочия президента Казахстана. Его родственники не смогут занимать руководящие посты в госкомпаниях",
            "short" => "Президент Казахстана Касым-Жомарт Токаев подписал ряд законов, ограничивающих президентские полномочия. Как сообщает пресс-служба президента, эти изменения были сделаны по итогам состоявшегося ранее референдума.",
            "description" => "Президент Казахстана Касым-Жомарт Токаев подписал ряд законов, ограничивающих президентские полномочия. Как сообщает пресс-служба президента, эти изменения были сделаны по итогам состоявшегося ранее референдума.

            Поправки предполагают незначительное ограничение влияния президента на местные исполнительные органы власти (теперь президент сможет назначать глав городов и регионов только с одобрения местных депутатов), сокращение президентской квоты в парламенте, а также запрет президенту состоять в политических партиях.
            
            Близким родственникам президента отныне запрещено занимать политические должности и руководящие посты субъектов квазигосударственного сектора.
            
            Помимо этого, новые законы закрепляют статус, полномочия и гарантии независимости уполномоченного по правам человека, а также усиливают правозащитные функции генерального прокурора. Кроме того, с 1 января 2023 года в Казахстане начнет функционировать Конституционный суд. 
            
            Внесение поправок в конституцию было предложено Токаевым в апреле, спустя три месяца после масштабных антиправительственных протестов, в рамках объявленного им курса на уход от суперпрезидентской республики к президентской республике с сильным парламентом. 5 июня состоялся референдум по этим поправкам; по официальным данным, поправки поддержали 77% жителей страны.
            
            Власти Казахстана преподносили поправки в конституцию как серьезный шаг в сторону демократизации страны, однако многие эксперты указывали, что реформы носят косметический характер и в действительности полномочия президента останутся крайне широкими.
            
            20 ноября в Казахстане пройдут внеочередные президентские выборы.",
            "category_id" => 1
        ],
        3 => [
            "id" => 3,
            "title" => "КНДР запустила четыре ракеты в сторону Желтого моря. Это уже третья серия пусков с начала ноября",
            "short" => "Северная Корея запустила четыре баллистические ракеты малой дальности в сторону Желтого моря. Об этом сообщает «Ренхап» со ссылкой на южнокорейских военных.",
            "description" => "Северная Корея запустила четыре баллистические ракеты малой дальности в сторону Желтого моря. Об этом сообщает «Ренхап» со ссылкой на южнокорейских военных.

            Объединенный комитет начальников штабов Южной Кореи заявил, что запуски произошли в районе полудня по местному времени (шесть утра по Москве). Ракеты пролетели около 130 километров с максимальной скоростью в 5 Махов и высотой в 20 километров. 
            
            Осенью 2022 года на фоне совместных военных учений США, Южной Кореи и Японии КНДР начала активные испытания. 2 ноября Северная Корея запустила около 20 ракет. Последний запуск произошел 3 ноября. Тогда Северная Корея испытала три ракеты, включая одну межконтинентальную.",
            "category_id" => 1
        ],
        4 => [
            "id" => 4,
            "title" => "«Манчестер Сити» в меньшинстве вырвал победу в матче чемпионата Англии с «Фулхэмом»",
            "short" => "Встреча завершилась со счетом 2:1. У хозяев отличились Хулиан Альварес и Эрлинг Холанд, реализовавший пенальти на пятой добавленной минуте ко второму тайму. В составе гостей мяч забил Андреас Перейра.",
            "description" => "«Манчестер Сити» одержал домашнюю победу над «Фулхэмом» в матче 15-го тура чемпионата Англии.

            Встреча завершилась со счетом 2:1. У хозяев отличились Хулиан Альварес и Эрлинг Холанд, реализовавший пенальти на пятой добавленной минуте ко второму тайму. В составе гостей мяч забил Андреас Перейра.
            
            «Сити» с 26-й минуты играл в меньшинстве — красную карточку получил Жоау Канселу.

            Команда Хосепа Гвардиолы с 32 очками лидирует в турнирной таблице премьер‑лиги, опережая на одно очко лондонский «Арсенал», у которого есть матч в запасе. «Фулхэм» (19) располагается на восьмой позиции.

            Чемпионат Англии. 2022-23. Тур 15
            «Манчестер Сити» (Манчестер) — «Фулхэм» (Лондон) — 2:1 (1:1)

            Голы: Альварес, 17. Холанд, 90 (с пенальти). — Перейра, 28 (с пенальти).

            Удаления: Канселу, 27. ",
            "category_id" => 2
        ],
        5 => [
            "id" => 5,
            "title" => "Лидер сборной Франции по баскетболу заявил, что ему плевать на тех, кто против его выступлений в «Зените»",
            "short" => "Федерация баскетбола Франции угрожает Эртелю исключением из сборной, если он будет выступать за «Зенит».",
            "description" => "В сентябре 33-летний разыгрывающий Эртель подписал контракт с «Зенитом». На прошедшем Евробаскете Франция дошла до финала, где проиграла Испании, а Эртель был одним из лидеров французской национальной команды.

            Эртель ранее опубликовал в соцсети фото в игровой форме «Зенита». Многие пользователи после этого раскритиковали его за решение перейти в клуб из России.
            
            — К сведению тех людей, которые критикуют меня за решение переехать в Россию. Просто имейте в виду, что мне абсолютно плевать. Так что можете не извиняться. Займитесь, пожалуйста, собственной жизнью! Заранее спасибо, — написал Эртель в социальной сети.
            
            Федерация баскетбола Франции угрожает Эртелю исключением из сборной, если он будет выступать за «Зенит».",
            "category_id" => 2
        ],
        6 => [
            "id" => 6,
            "title" => "В «Формуле-1» может появиться гонщик из России. Роберт изящно обошёл санкции",
            "short" => "Роберт Шварцман — один из претендентов на место в «Хаасе», которое, кажется, скоро станет вакантным.",
            "description" => "Вместе с перерывом в чемпионате «Формулы-1» началась волна переходов пилотов и трансферных слухов. Журналисты говорят о возможном уходе из «Хааса» пилота с самой известной гоночной фамилией — Мика Шумахера. На место, которое еще не стало вакантным, уже набралось много претендентов, один из них — пилот из России Роберт Шварцман.
            
            Хотя сезон в «Формуле-1» еще не закончился, Никита Мазепин — без сомнений его главный неудачник. Сын российского олигарха собирался начинать свой второй год в составе «Хааса», когда американская команда отказалась от услуг пилота и спонсорства «Уралкалия».
            
            Мазепин был готов пойти на уступки, например, подписать подготовленную Международной автомобильной федерацией (FIA) декларацию, затрагивающую в основном политические моменты. Но «Хаас» из-за репутационных рисков все же решил отказаться от российского пилота и за две недели до старта чемпионата предложил контракт своему бывшему гонщику Кевину Магнуссену.

            Теперь Мазепин судится с «Хаас» из-за невыплаченной зарплаты и защищает интересы пострадавших из-за санкций спортсменов. Путь в «Формулу-1» ему теперь однозначно закрыт.",
            "category_id" => 2
        ],
        7 => [
            "id" => 7,
            "title" => "Созданы ДНК-капсулы для упаковки опасных противораковых лекарств",
            "short" => "Они будут точечно доставлять препарат в опухолевые клетки и снизят нагрузку на организм",
            "description" => "ТАСС, 2 ноября. Канадские биохимики разработали наноструктуры на базе ДНК, способные точечно доставлять молекулы нестабильных и токсичных противораковых лекарств в опухолевые клетки. Это позволит снизить нагрузку на организм и повысить эффективность препаратов. Работа опубликована в журнале Nature Communications. О результатах сообщила в среду пресс-служба Монреальского университета.
            
            \"Огромным плюсом наших нанотранспортеров является их высокая универсальность. Мы уже показали, что их можно использовать с двумя разными типами лекарств. Высокая гибкость и программируемость ДНК и белков позволит нам создать аналогичные наноконтейнеры для широкого перечня лекарств\", - заявил доцент Монреальского университета (Канада) Алексис Валле-Белиль, чьи слова приводит пресс-служба вуза.

            За последнее десятилетие ученые создали несколько основанных на базе различных наночастиц принципиально новых методов лечения рака и других болезней. В некоторых случаях эти структуры принимают непосредственное участие в уничтожении опухоли или ликвидации источника болезни, а в других - служат средством доставки лекарств и токсинов в опухоль или орган, что позволяет врачам усилить эффективность работы этих веществ и снизить их дозу.

            Валле-Белиль и его коллеги разработали новый тип наноконтейнеров для адресной доставки противоопухолевых препаратов в раковые клетки, основой для которых послужили трехмерные конструкции из цепочек ДНК. Ученые совершили это открытие в ходе изучения того, как белки в человеческих клетках транспортируют различные гормоны и прочие важные сигнальные молекулы.",
            "category_id" => 3
        ],
        8 => [
            "id" => 8,
            "title" => "На арктическом острове Колгуев выявили пять видов шмелей",
            "short" => "Три из них массовые и два малочисленные",
            "information" => "АРХАНГЕЛЬСК, 2 ноября. /ТАСС/. Ученые Федерального исследовательского центра комплексного изучения Арктики Уральского отделения РАН (ФИЦКИА) обнаружили пять видов шмелей на острове Колгуев в Баренцевом море, генетические исследования насекомых на этом арктическом острове проводились впервые, рассказал ТАСС руководитель исследовательской группы, ведущий научный сотрудник лаборатории приарктических лесных экосистем центра Григорий Потапов.

            \"До этого такие исследования не проводились, были только единичные сборы. Мы провели инвентаризацию этой группы насекомых-опылителей на Колгуеве. Провели генетические исследования, впервые по насекомым Колгуева. Всего выявлено пять видов шмелей: три массовых и два малочисленных\", - сказал Потапов.
            
            К распространенным относятся Bombus lapponicus, B. pyrrhopygus, B. Balteatus, к редким: Bombus flavidus, B. jonellus. Все они заселились на остров с материка. \"Этот остров геологически молодой, он образовался несколько тысяч лет назад, и поэтому там вся фауна насекомых является мигрантами с материка\", - пояснил собеседник агентства.
            
            Шмели способны мигрировать на достаточно большие расстояния. Ширина Поморского пролива, отделяющего Колгуев от материка, составляет около 70 км. Насекомые вполне могут пролететь такое расстояние, возможно, часть видов попала на Колгуев относительно недавно.",
            "category_id" => 3
        ],
        9 => [
            "id" => 9,
            "title" => "Британские эксперты создали с помощью робота мраморную копию древнегреческой скульптуры",
            "short" => "Памятник изображает голову коня древнегреческой богини луны Селены",
            "description" => "ЛОНДОН, 1 ноября. /ТАСС/. Специалисты из оксфордского Института цифровой археологии отсканировали одну из скульптур Парфенона и использовали робота, чтобы изготовить из греческого мрамора ее точную копию. Об этом сообщила во вторник газета The Times.

            Античный памятник изображает голову коня древнегреческой богини луны Селены. На его воспроизведение из глыбы в одну тонну у машины, оснащенной алмазными пилами, ушло пять дней.
            
            Директор института Роджер Майкл заявил, что ученые планируют скопировать еще один элемент убранства храма - метопу (декоративную плиту) с изображением битвы между человеком и кентавром. Джордж Осборн, председатель попечительского совета Британского музея, где в настоящее время хранятся древние памятники, не исключил, что оригиналы и копии будут выставлены совместно.
            
            Коллекция мраморных скульптур Парфенона была приобретена музеем в 1816 году у лорда Элгина, который в начале XIX века вывез их из Греции, находившейся под властью Османской империи. Греческие власти настаивают, что Элгин действовал незаконно, и добиваются возвращения скульптур в Афины. Британская сторона неоднократно отвечала на подобные просьбы отказом. В сентябре премьер-министр Греции Кириакос Мицотакис заявил, что Межправительственная комиссия ЮНЕСКО и подавляющее большинство государств - членов организации поддержали требования страны.",
            "category_id" => 3
        ],
        10 => [
            "id" => 10,
            "title" => "Россия сократила добычу газа",
            "short" => "Росстат сообщает, что добыча газа в стране сократилась на 12,1% в январе-сентябре в сравнении с предыдущим годом. А именно в сентябре она упала на 26,4%. Пора ли беспокоиться за национальное достояние?",
            "description" => "Росстат сообщает, что добыча газа в стране сократилась на 12,1% в январе-сентябре в сравнении с предыдущим годом. А именно в сентябре она упала на 26,4%. Пора ли беспокоиться за национальное достояние?

            Добыча газа, не поверите, зависит от ее продажи. С продажами сейчас у нас тяжко — Европа сильно сократила закупки. Отдельные страны вроде Венгрии и Сербии продолжают покупать как ни в чем ни бывало, но Прибалтика с Польшей не закупают его совсем.
            
            Помимо Европы, Россия продает газ, например, в Турцию. Более того, там собираются делать газовый хаб. Проблема в том, что Анкара хочет отсрочить оплату газа до 2024 года. А это, в общем, на продажах тоже отражается.
            
            Факт в том, что продажи газа в России сокращаются. А с ним — и добыча. И такое, скорее всего, будет продолжаться.",
            "category_id" => 4
        ],
        11 => [
            "id" => 11,
            "title" => "Потолок цен на нефть. Как-то не задалось",
            "short" => "В США заявляют, что потолок цен на российскую нефть будут пересматривать. По $60 ограничить не получается.",
            "description" => "Почему? Есть риск, что этот удар по касательной зацепит и западные страны. Если львиная доля государств согласится с такой ценой, Россия просто не станет продавать нефть. А это приведет к недостатку ее на рынке и стремительному взлету цены. То есть корреляция налицо: потолок цен на нефть — нефть по $300. 

            Да и поддержать пока никто не поддерживает. Помимо стран Большой Семерки к ограничениям присоединяется лишь Австралия — не то, чтобы значимый покупатель. Китай с Индией остаются в стороне. 
            
            Все идет к тому, что потолок либо поднимут, либо вообще уберут. Ведь вполне можно пойти по иному пути — сделать слишком неудобной торговлю российской нефтью. Ограничения удлинняют цепочки, вызывают проблемы со страхованием. В итоге РФ приходится больше давать скидок, чтобы ресурс покупал хоть кто-то. Кран закрывается не сразу, а постепенно. И вот такая стратегия более, чем реальна — с банковским сектором работает.",
            "category_id" => 4
        ],
        12 => [
            "id" => 12,
            "title" => "ЦБ сохраняет ставку",
            "short" => "Шесть раз подряд Центробанк опускал ключевую ставку. А вот сейчас не стал — она осталась на уровне 7,5%.",
            "description" => "Почему так? Годовая инфляция уже начинает замедляться. По словам ЦБ, она уже в октябре достигает 12,9%. К концу года она вряд ли сильно прибавит. С другой стороны, в среднесрочной перспективе риски повышения инфляции увеличились — взять хотя бы ту же мобилизацию, которая в отдельных категориях продуктов изрядно разогнала цены.

            В общем и целом, ЦБ держит руку на пульсе. Скорее всего, когда инфляция пойдет вверх — увеличится и ставка. Соответственно, если вы планировали взять ипотеку — надо брать сейчас, лучше ставка в ближайшее время не станет.",
            "category_id" => 4
        ],
    ];

    public static function getAll(): array
    {
        return static::$news;
    }

    public static function getOne(int $id): ?array
    {
        return static::$news[$id] ?? null;
    }

    public static function getByCategory(int $id): ?array
    {
        $newsByCategory = [];
        foreach (static::$news as $item)
        {
            if ($item["category_id"] == $id)
            {
                $newsByCategory[] = $item;
            }
        }
        return $newsByCategory ?? null;
    }
}
